backend/rails-application/app/controllers/api/v1/prodotto_controller.rb

SELECT "prodottos".* FROM "prodottos"
---
    def index
        prodotti = Prodotto.all

INSERT INTO "prodottos" ("nome_oggetto", "descrizione", "tipo_prodotto_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
    def create
        prodotto = Prodotto.new(
            nome_oggetto: prodotto_params[:nome_oggetto],
            descrizione: prodotto_params[:descrizione],
            tipo_prodotto_id: prodotto_params[:tipo_prodotto_id]
        )
        if prodotto.save

SELECT "prodottos".* FROM "prodottos" WHERE "prodottos"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "prodottos" SET "nome_oggetto" = $1, "descrizione" = $2, "tipo_prodotto_id" = $3, "updated_at" = $4 WHERE "prodottos"."id" = $5  [["nome_oggetto", "test"], ["descrizione", "prova prova prova"], ["tipo_prodotto_id", 2], ["updated_at", "2024-06-08 20:53:01.283332"], ["id", 7]]
---
    def update
        prodotto = Prodotto.find_by(id: params[:id])
        if prodotto
            prodotto.update(
                nome_oggetto: params[:nome_oggetto],
                descrizione: params[:descrizione],
                tipo_prodotto_id: params[:tipo_prodotto_id]
            )

SELECT "prodottos".* FROM "prodottos" WHERE "prodottos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "prodottos" WHERE "prodottos"."id" = $1  [["id", 1]]
---
    def destroy
        prodotto = Prodotto.find_by(id: params[:id])
        if prodotto
            prodotto.destroy