backend/rails-application/app/controllers/api/v1/tipo_prodotto_controller.rb

SELECT "tipo_prodottos".* FROM "tipo_prodottos"
---
    def index
        tipo_prodotto = TipoProdotto.all

SELECT "tipo_prodottos".* FROM "tipo_prodottos" WHERE "tipo_prodottos"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def show
        tipo_prodotto = TipoProdotto.find_by(id: params[:id])

INSERT INTO "tipo_prodottos" ("tipo", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["tipo", "toner"], ["created_at", "2024-06-04 09:56:22.093830"], ["updated_at", "2024-06-04 09:56:22.093830"]]
---
    def create
        tipo_prodotto = TipoProdotto.new(
            tipo: tipo_prodotto_params[:tipo]
          )
          if tipo_prodotto.save