backend/rails-application/app/controllers/api/v1/utenti_controller.rb

INSERT INTO "utentis" ("username", "password", "nome", "cognome", "data_nascita", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    utenti = Utenti.new(
      username: utenti_params[:username],
      password: utenti_params[:password],
      nome: utenti_params[:nome],
      cognome: utenti_params[:cognome],
      data_nascita: utenti_params[:data_nascita]
    )
    if utenti.save