backend/rails-application/app/controllers/api/v1/utenti_controller.rb

  def show_by_username
    logger.warn "It works!"
    utente = Utenti.find_by(username: params[:username])
---
SELECT "utentis".* FROM "utentis" WHERE "utentis"."username" = $1 LIMIT $2  [["username", "admin"], ["LIMIT", 1]]

  def index
    utenti = Utenti.all
---
SELECT "utentis".* FROM "utentis"

  def show
    utenti = Utenti.find_by(id: params[:id])
---
SELECT "utentis".* FROM "utentis" WHERE "utentis"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]

  def create
    utenti = Utenti.new(
      username: utenti_params[:username],
      password: utenti_params[:password],
      nome: utenti_params[:nome],
      cognome: utenti_params[:cognome],
      data_nascita: utenti_params[:data_nascita]
    )
    if utenti.save
---
INSERT INTO "utentis" ("username", "password", "nome", "cognome", "data_nascita", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    utenti = Utenti.find_by(id: params[:id])
    if utenti
      utenti.update(username: params[:username], password: params[:password], nome: params[:nome], cognome: params[:cognome], data_nascita: params[:data_nascita]);
---
SELECT "utentis".* FROM "utentis" WHERE "utentis"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "utentis" SET "username" = $1, "password" = $2, "nome" = $3, "cognome" = $4, "data_nascita" = $5, "updated_at" = $6 WHERE "utentis"."id" = $7  [["username", nil], ["password", "[FILTERED]"], ["nome", nil], ["cognome", nil], ["data_nascita", nil], ["updated_at", "2024-06-06 19:06:25.761728"], ["id", 4]]

  def destroy
    utenti = Utenti.find_by(id: params[:id])
    if utenti
      utenti.destroy
---
SELECT "utentis".* FROM "utentis" WHERE "utentis"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
DELETE FROM "utentis" WHERE "utentis"."id" = $1  [["id", 7]]