backend/rails-application/app/controllers/api/v1/utenti_controller.rb

SELECT "utentis".* FROM "utentis" WHERE "utentis"."username" = $1 LIMIT $2  [["username", "admin@site.com"], ["LIMIT", 1]]
---
  def show
    usernameFornito = params[:username];
    puts usernameFornito;
    utenti = Utenti.find_by(username: usernameFornito)